{
  "backend/main.mo": "Minimal Motoko actor with no methods or state.",
  "feature_evidence.json": "Feature evidence report documenting print-specific typography/spacing adjustments and listing affected files and components.",
  "frontend-file-summaries.txt": "Reference file containing prewritten summaries of key frontend components, utilities, and styles.",
  "frontend/index.css": "Base Tailwind setup defining OKLCH theme variables, dark-mode overrides, and global background/foreground styling.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Top-level React component managing all report-card state and handling print, export, import, and reset actions.",
  "frontend/src/components/ReportCard/AttendanceAndResult.tsx": "Form section for attendance, result, and remarks with compact print-focused layout.",
  "frontend/src/components/ReportCard/CoScholasticFields.tsx": "Table for editing co‑scholastic field grades with reduced print padding and font sizes.",
  "frontend/src/components/ReportCard/ReportCardLayout.tsx": "Layout wrapper rendering school headers and student info fields with print‑optimized spacing and background form image.",
  "frontend/src/components/ReportCard/ScholasticTable.tsx": "Renders a detailed marks table for each subject, computing totals and derived values using imported mark utilities. Handles validation, formatting, and input updates per subject row.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s Internet Identity, refreshing dependent queries when the identity changes. Returns the current actor and its fetch status.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an authentication context using Internet Identity, handling login, stored identity loading, and state management for auth status. Exposes hooks to access identity and control login/logout.",
  "frontend/src/index.css": "Defines global Tailwind CSS variables, base styles, and extensive print styles for consistent report card formatting. Includes light/dark theme tokens and utility overrides for print layout.",
  "frontend/src/lib/defaultData.ts": "Exports default subject and field mark templates with empty initial values for initializing report card state. Provides predefined subject and co‑scholastic field lists.",
  "frontend/src/lib/marks.ts": "Implements parsing, formatting, and calculation utilities for UT totals, weighted components, overall totals, column sums, and percentage. Performs validation checks before aggregating marks.",
  "frontend/src/lib/reportCardIO.ts": "Builds export payloads, downloads report card data as JSON, and validates imported JSON structures. Ensures subjects, fields, attendance, and metadata match expected formats.",
  "frontend/src/lib/types.ts": "Defines TypeScript interfaces for subjects, fields, attendance, totals, and full report card state and export payloads. Centralizes type definitions for marks and report card data.",
  "frontend/src/lib/utils.ts": "Exports a utility function that merges Tailwind class names using clsx and tailwind-merge. Simplifies conditional class name composition.",
  "frontend/src/lib/validation.ts": "Provides validation helpers for numeric inputs, checking range bounds and non‑negativity, returning structured validation results.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and renders the root App component.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, typography, animations, container settings, and plugin setup.",
  "project_state.json": "Stores the project’s state, requirements, known issues, and architectural notes for building the marks-report app."
}