{
  "kind": "build_request",
  "title": "Reduce print font sizes so the report card fits on a single A4 landscape page",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-23",
      "text": "Adjust print-specific typography and spacing so the entire report card reliably fits on a single A4 landscape page by making fonts smaller (and tightening vertical spacing where needed) without changing the table structure or calculations.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Why are you facing the problem just make the fonts small so that everything can fit in a single page"
        ]
      },
      "acceptanceCriteria": [
        "When using the browser Print dialog, the report card prints on exactly one A4 landscape page (no second page).",
        "Printed output is not clipped on any edge; all sections (header, scholastic table, co-scholastic fields, attendance/result/remarks, signatures) remain visible.",
        "Font sizes in print are reduced compared to on-screen where needed, while keeping the layout readable and visually consistent with the existing report-card style.",
        "No changes to marks calculations, subject rows, export/import/reset behavior, or non-print on-screen layout besides any necessary print-only adjustments."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be edited: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Keep the backend as a single Motoko actor; no backend changes are required for this request."
  ],
  "nonGoals": [
    "Retrying or diagnosing deployment/build pipeline errors.",
    "Changing the report card’s data model, calculations, validations, or subject/field lists.",
    "Altering the table column structure or removing sections to make it fit."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}