{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Print-only typography and spacing adjustments to fit report card on one A4 landscape page",
  "requirements": [
    {
      "id": "REQ-23",
      "summary": "Tighten print-only font sizes, line heights, paddings, and vertical gaps so the full report card fits on one A4 landscape page without changing table structure or any calculations.",
      "acceptanceCriteria": [
        "When using the browser Print dialog, the report card prints on exactly one A4 landscape page (no second page).",
        "Printed output is not clipped on any edge; all sections (header, scholastic table, co-scholastic fields, attendance/result/remarks, signatures) remain visible.",
        "Font sizes in print are reduced compared to on-screen where needed, while keeping the layout readable and visually consistent with the existing report-card style.",
        "No changes to marks calculations, subject rows, export/import/reset behavior, or non-print on-screen layout besides any necessary print-only adjustments."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Refine @media print rules to reduce typography and tighten vertical spacing: slightly reduce @page margins if needed; introduce print-only base font-size/line-height for the report card container; reduce table cell padding and heading line-heights; tighten default margins around headers/sections; ensure no clipping by keeping print overflow visible where relevant. Keep all changes print-scoped and avoid altering non-print layout."
        },
        {
          "path": "frontend/src/components/ReportCard/ReportCardLayout.tsx",
          "operation": "modify",
          "description": "Add a stable, report-card-specific wrapper class (e.g., a dedicated className on the outer wrapper and/or content overlay) so print CSS can target the report card precisely; tighten print-only padding/margins in the header and student-info block (e.g., smaller print padding and reduced print bottom margins) without changing structure."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Tighten print-only spacing between major sections by adding/adjusting print utility classes on the main content stack, the lower two-column grid (gap), and the signature section (margin-top, padding-top, signature line height) so the full layout fits on one printed page; keep on-screen spacing unchanged."
        },
        {
          "path": "frontend/src/components/ReportCard/CoScholasticFields.tsx",
          "operation": "modify",
          "description": "Add print-only typography/spacing utility classes to the section title and surrounding spacing (e.g., reduce print font-size and margin-bottom) and, if necessary, apply print-only tighter input height/padding via className to improve vertical compactness while keeping the table structure unchanged."
        },
        {
          "path": "frontend/src/components/ReportCard/AttendanceAndResult.tsx",
          "operation": "modify",
          "description": "Add print-only typography/spacing utility classes to reduce vertical footprint: tighten section title margins, container padding, row gaps, and input/textarea heights for print only; preserve on-screen layout and do not change any data handling."
        }
      ]
    }
  ]
}